In [ ]:
print("Hello World")

In [ ]:
a=input()
if(a=='red'):
    print("primary colour")
elif(a=='green'):
    print("primary colour")
elif(a=='blue'):
    print("primary colour")
else:
    print("colour")

In [ ]:
a=input()
if(a=='red'or a=='blue'or a=='green'):
    print("primary colour")
else:
    print("colour")

In [ ]:
#!pip3 install pandas

In [ ]:
import pandas as pd
import numpy as np

In [1]:
import pandas as pd

In [2]:
#read the data
data=pd.read_csv("/home/placenent/Desktop/marks.txt")

In [3]:
#to describe data
data.describe()

           srno        pincode      marks
count  6.000000       6.000000   5.000000
mean   3.500000  594228.666667  96.400000
std    1.870829  258269.015752   1.516575
min    1.000000  245568.000000  95.000000
25%    2.250000  476256.750000  95.000000
50%    3.500000  548733.000000  96.000000
75%    4.750000  724113.750000  98.000000
max    6.000000  987666.000000  98.000000

In [4]:
data.head(3)

   srno    name  pincode   city branch  marks
0     1  rushmi   534678    hyd    ece   95.0
1     2    hema   456783    viz    cse   96.0
2     3     uma   562788  delhi    cse   95.0

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   srno     6 non-null      int64
 1   name     6 non-null      object
 2   pincode  6 non-null      int64
 3   city     6 non-null      object
 4   branch   6 non-null      object
 5   marks    5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 416.0+ bytes

In [6]:
data.tail(3)

   srno  name  pincode     city branch  marks
3     4  lucy   777889  chennai     IT   98.0
4     5  alex   987666  kolkata     IT   98.0
5     6   wes   245568   mumbai     94    NaN

In [7]:
data['name'].unique()

array(['rushmi', 'hema', 'uma', 'lucy', 'alex', 'wes'], dtype=object)